{
  "chapters": [
    {
      "id": 1,
      "title": "学而篇",
      "content": "子曰：学而时习之，不亦说乎？有朋自远方来，不亦乐乎？人不知而不愠，不亦君子乎？\n\n曾子曰：吾日三省吾身：为人谋而不忠乎？与朋友交而不信乎？传不习乎？\n\n子曰：君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉，可谓好学也已。",
      "quote": "学而时习之，不亦说乎？",
      "interpretation": "《学而》是《论语》第一篇，主要讲学习和修养。孔子强调学习后要时常温习实践，这才是真正的快乐。君子应当追求学问而非物质享受。"
    },
    {
      "id": 2,
      "title": "为政篇",
      "content": "子曰：为政以德，譬如北辰，居其所而众星共之。\n\n子曰：吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不逾矩。\n\n子曰：学而不思则罔，思而不学则殆。",
      "quote": "学而不思则罔，思而不学则殆。",
      "interpretation": "《为政》主要讲政治和教育。孔子以德治国的思想影响深远。'三十而立'等人生阶段划分，至今仍被广泛引用。学习与思考必须结合。"
    },
    {
      "id": 3,
      "title": "八佾篇",
      "content": "孔子谓季氏：八佾舞于庭，是可忍也，孰不可忍也？\n\n子曰：人而不仁，如礼何？人而不仁，如乐何？\n\n子曰：君子无所争，必也射乎！揖让而升，下而饮，其争也君子。",
      "quote": "人而不仁，如礼何？人而不仁，如乐何？",
      "interpretation": "《八佾》讨论礼乐制度。孔子强调礼乐的根本在于仁德，没有仁德，礼乐只是空洞的形式。礼仪之争也应体现君子风度。"
    },
    {
      "id": 4,
      "title": "里仁篇",
      "content": "子曰：里仁为美。择不处仁，焉得知？\n\n子曰：不仁者不可以久处约，不可以长处乐。仁者安仁，知者利仁。\n\n子曰：朝闻道，夕死可矣。\n\n子曰：君子喻于义，小人喻于利。",
      "quote": "朝闻道，夕死可矣。",
      "interpretation": "《里仁》讲仁德修养。孔子认为环境对人的影响很大，应选择仁德之地居住。追求真理比生命更重要，君子看重道义而非私利。"
    },
    {
      "id": 5,
      "title": "公冶长篇",
      "content": "子谓公冶长：可妻也。虽在缧绁之中，非其罪也。以其子妻之。\n\n子贡问曰：赐也何如？子曰：女，器也。曰：何器也？曰：瑚琏也。\n\n子曰：道不行，乘桴浮于海。从我者，其由与？",
      "quote": "道不行，乘桴浮于海。",
      "interpretation": "《公冶长》通过评价人物来阐述道德标准。孔子欣赏公冶长的品德，即使被囚禁也不改变对其的评价。当理想无法实现时，宁愿避世。"
    },
    {
      "id": 6,
      "title": "雍也篇",
      "content": "子曰：雍也可使南面。\n\n子曰：贤哉，回也！一箪食，一瓢饮，在陋巷，人不堪其忧，回也不改其乐。贤哉，回也！\n\n子曰：知者乐水，仁者乐山。知者动，仁者静。知者乐，仁者寿。",
      "quote": "贤哉，回也！一箪食，一瓢饮，在陋巷，人不堪其忧，回也不改其乐。",
      "interpretation": "《雍也》赞扬颜回等弟子的品德。颜回安贫乐道的精神是儒家理想人格的典范。智者与仁者各有特点，智者活泼，仁者稳重。"
    },
    {
      "id": 7,
      "title": "述而篇",
      "content": "子曰：述而不作，信而好古，窃比于我老彭。\n\n子曰：默而识之，学而不厌，诲人不倦，何有于我哉？\n\n子曰：德之不修，学之不讲，闻义不能徙，不善不能改，是吾忧也。",
      "quote": "默而识之，学而不厌，诲人不倦。",
      "interpretation": "《述而》记录孔子的教育态度。孔子谦虚地说自己只是传述而非创作。他主张默默学习、永不满足、教导他人不知疲倦。"
    },
    {
      "id": 8,
      "title": "泰伯篇",
      "content": "子曰：泰伯，其可谓至德也已矣。三以天下让，民无得而称焉。\n\n曾子曰：士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？\n\n子曰：恭而无礼则劳，慎而无礼则葸，勇而无礼则乱，直而无礼则绞。",
      "quote": "士不可以不弘毅，任重而道远。",
      "interpretation": "《泰伯》赞扬泰伯让位的高尚品德。曾子提出士人应当有宽广的胸怀和坚毅的品格，因为肩负实现仁德的重任，道路漫长。"
    },
    {
      "id": 9,
      "title": "子罕篇",
      "content": "子罕言利与命与仁。\n\n子曰：吾有知乎哉？无知也。有鄙夫问于我，空空如也。我叩其两端而竭焉。\n\n子曰：凤鸟不至，河不出图，吾已矣夫！\n\n子在川上曰：逝者如斯夫！不舍昼夜。",
      "quote": "逝者如斯夫！不舍昼夜。",
      "interpretation": "《子罕》记录孔子很少主动谈论利、命、仁。他在河边感叹时光像流水一样不停流逝，勉励人们珍惜时间、自强不息。"
    },
    {
      "id": 10,
      "title": "乡党篇",
      "content": "孔子于乡党，恂恂如也，似不能言者。其在宗庙朝廷，便便言，唯谨尔。\n\n食不厌精，脍不厌细。食饐而餲，鱼馁而肉败，不食。色恶，不食。臭恶，不食。\n\n席不正，不坐。食不语，寝不言。",
      "quote": "食不语，寝不言。",
      "interpretation": "《乡党》记录孔子的日常生活和礼仪规范。孔子在不同场合有不同的举止，在饮食上讲究卫生和礼节，体现了儒家的生活美学。"
    },
    {
      "id": 11,
      "title": "先进篇",
      "content": "子曰：先进于礼乐，野人也；后进于礼乐，君子也。如用之，则吾从先进。\n\n子路、曾皙、冉有、公西华侍坐。子曰：以吾一日长乎尔，毋吾以也。居则曰：不吾知也！如或知尔，则何以哉？\n\n子曰：过犹不及。",
      "quote": "过犹不及。",
      "interpretation": "《先进》通过孔子与弟子的对话，讨论治国理想。孔子赞同曾皙的志向：在暮春时节与友人游泳、吹风、歌唱。做事过分与不足同样不好。"
    },
    {
      "id": 12,
      "title": "颜渊篇",
      "content": "颜渊问仁。子曰：克己复礼为仁。一日克己复礼，天下归仁焉。为仁由己，而由人乎哉？\n\n仲弓问仁。子曰：出门如见大宾，使民如承大祭。己所不欲，勿施于人。\n\n司马牛问仁。子曰：仁者，其言也讱。",
      "quote": "己所不欲，勿施于人。",
      "interpretation": "《颜渊》是《论语》中讨论仁的重要篇章。孔子对不同的人解释仁：约束自己、遵循礼制；自己不想要的，不要强加给别人。这是儒家的黄金法则。"
    },
    {
      "id": 13,
      "title": "子路篇",
      "content": "子路问政。子曰：先之劳之。请益。曰：无倦。\n\n子曰：其身正，不令而行；其身不正，虽令不从。\n\n子曰：苟正其身矣，于从政乎何有？不能正其身，如正人何？\n\n子曰：无欲速，无见小利。欲速则不达，见小利则大事不成。",
      "quote": "其身正，不令而行；其身不正，虽令不从。",
      "interpretation": "《子路》讨论政治治理。孔子强调统治者应当以身作则，自身正直，百姓自然会效仿。做事不能急于求成，贪图小利会妨碍大事。"
    },
    {
      "id": 14,
      "title": "宪问篇",
      "content": "宪问耻。子曰：邦有道，谷；邦无道，谷，耻也。\n\n子曰：士而怀居，不足以为士矣。\n\n子曰：有德者必有言，有言者不必有德。仁者必有勇，勇者不必有仁。\n\n子曰：爱之，能勿劳乎？忠焉，能勿诲乎？",
      "quote": "有德者必有言，有言者不必有德。",
      "interpretation": "《宪问》讨论士人的品格标准。有德之人自然会表现出善言，但善辩之人未必有德。仁者必然勇敢，但勇敢的人未必仁德。"
    },
    {
      "id": 15,
      "title": "卫灵公篇",
      "content": "卫灵公问陈于孔子。孔子对曰：俎豆之事，则尝闻之矣；军旅之事，未之学也。明日遂行。\n\n子曰：君子固穷，小人穷斯滥矣。\n\n子曰：人无远虑，必有近忧。\n\n子曰：君子求诸己，小人求诸人。",
      "quote": "人无远虑，必有近忧。",
      "interpretation": "《卫灵公》记录孔子在卫国的经历。君子即使贫困也能坚守原则，小人贫困就会胡作非为。人要有长远打算，否则会有眼前忧虑。君子要求自己，小人要求别人。"
    },
    {
      "id": 16,
      "title": "季氏篇",
      "content": "季氏将伐颛臾。冉有、季路见于孔子曰：季氏将有事于颛臾。\n\n孔子曰：求！无乃尔是过与？夫颛臾，昔者先王以为东蒙主，且在邦域之中矣，是社稷之臣也。何以伐为？\n\n益者三友，损者三友。友直，友谅，友多闻，益矣。友便辟，友善柔，友便佞，损矣。",
      "quote": "益者三友，损者三友。",
      "interpretation": "《季氏》通过季氏伐颛臾事件，讨论仁政与霸道。孔子反对无谓的战争。交友应当选择正直、诚信、博学之人，避免谄媚、虚伪、夸夸其谈之人。"
    },
    {
      "id": 17,
      "title": "阳货篇",
      "content": "阳货欲见孔子，孔子不见，归孔子豚。孔子时其亡也，而往拜之。遇诸途。\n\n子曰：唯上知与下愚不移。\n\n子曰：性相近也，习相远也。\n\n子曰：乡愿，德之贼也。",
      "quote": "性相近也，习相远也。",
      "interpretation": "《阳货》讨论人性与教育。孔子认为人的本性相近，因习惯不同而相差甚远。这强调了后天学习的重要性。没有原则的'老好人'是道德的败坏者。"
    },
    {
      "id": 18,
      "title": "微子篇",
      "content": "微子去之，箕子为之奴，比干谏而死。孔子曰：殷有三仁焉。\n\n柳下惠为士师，三黜。人曰：子未可以去乎？曰：直道而事人，焉往而不三黜？枉道而事人，何必去父母之邦？\n\n楚狂接舆歌而过孔子曰：凤兮凤兮！何德之衰？往者不可谏，来者犹可追。已而已而！今之从政者殆而！",
      "quote": "往者不可谏，来者犹可追。",
      "interpretation": "《微子》记录孔子对古代贤人的评价。微子、箕子、比干是殷商的三位仁者。楚狂接舆以凤鸟比喻孔子，劝他归隐：过去的无法挽回，未来的还来得及。"
    },
    {
      "id": 19,
      "title": "子张篇",
      "content": "子张曰：士见危致命，见得思义，祭思敬，丧思哀，其可已矣。\n\n子张曰：执德不弘，信道不笃，焉能为有？焉能为亡？\n\n子夏曰：博学而笃志，切问而近思，仁在其中矣。\n\n子贡曰：君子之过也，如日月之食焉。过也，人皆见之；更也，人皆仰之。",
      "quote": "博学而笃志，切问而近思，仁在其中矣。",
      "interpretation": "《子张》记录弟子们的言论。子夏的学习方法：广泛学习、坚定志向、恳切提问、思考当前问题，仁德就在其中。君子的过错像日食月食，改正后人们依然敬仰。"
    },
    {
      "id": 20,
      "title": "尧曰篇",
      "content": "尧曰：咨！尔舜！天之历数在尔躬，允执其中。四海困穷，天禄永终。\n\n舜亦以命禹。曰：予小子履，敢用玄牡，敢昭告于皇皇后帝：有罪不敢赦。帝臣不蔽，简在帝心。朕躬有罪，无以万方；万方有罪，罪在朕躬。\n\n子曰：不知命，无以为君子也；不知礼，无以立也；不知言，无以知人也。",
      "quote": "不知命，无以为君子也；不知礼，无以立也；不知言，无以知人也。",
      "interpretation": "《尧曰》是《论语》最后一篇，记录古代圣王的训诫。孔子总结：不懂得天命，不能成为君子；不懂得礼，不能立足社会；不懂得分辨言语，不能了解人。"
    }
  ],
  "last_sent_id": 0,
  "total_chapters": 20
}
