{
  "chapters": [
    {
      "id": 1,
      "title": "逍遥游",
      "content": "北冥有鱼，其名为鲲。鲲之大，不知其几千里也；化而为鸟，其名为鹏。鹏之背，不知其几千里也；怒而飞，其翼若垂天之云。是鸟也，海运则将徙于南冥。南冥者，天池也。\n\n【解读】逍遥游是庄子哲学的核心篇章，阐述「无待」的境界。大鹏虽然能飞九万里，但仍需风；列子御风而行，但仍需风。真正的逍遥是「乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉？」——顺应自然，无所依赖，心灵自由。",
      "quote": "至人无己，神人无功，圣人无名。"
    },
    {
      "id": 2,
      "title": "齐物论",
      "content": "南郭子綦隐机而坐，仰天而嘘，答焉似丧其耦。颜成子游立侍乎前，曰：「何居乎？形固可使如槁木，而心固可使如死灰乎？今之隐机者，非昔之隐机者也。」\n\n【解读】齐物论探讨万物齐一的思想。庄子认为，是非、彼此、生死都是相对的，从「道」的观点看，万物齐同为一。「天地与我并生，而万物与我为一」，破除分别心，才能达到心灵的解脱。",
      "quote": "天地一指也，万物一马也。"
    },
    {
      "id": 3,
      "title": "养生主",
      "content": "吾生也有涯，而知也无涯。以有涯随无涯，殆已！已而为知者，殆而已矣！为善无近名，为恶无近刑。缘督以为经，可以保身，可以全生，可以养亲，可以尽年。\n\n庖丁为文惠君解牛，手之所触，肩之所倚，足之所履，膝之所踦，砉然向然，奏刀騞然，莫不中音。合于《桑林》之舞，乃中《经首》之会。\n\n【解读】养生主阐述养生之道的核心在于「缘督以为经」——顺应自然的中正之道。庖丁解牛的寓言说明，顺应事物的自然规律，就能游刃有余，达到「技进乎道」的境界。",
      "quote": "吾生也有涯，而知也无涯。以有涯随无涯，殆已！"
    },
    {
      "id": 4,
      "title": "人间世",
      "content": "颜回见仲尼，请行。曰：「奚之？」曰：「将之卫。」曰：「奚为焉？」曰：「回闻卫君，其年壮，其行独；轻用其国，而不见其过；轻用民死，死者以国量乎泽若蕉，民其无如矣。回尝闻之夫子曰：治国去之，乱国就之，医门多疾。愿以所闻思其则，庶几其国有瘳乎！」\n\n【解读】人间世探讨如何在乱世中处世。庄子借颜回与孔子的对话，说明「心斋」的境界——虚静其心，排除杂念，顺应自然。「知其不可奈何而安之若命，德之至也」，在无法改变的环境中，保持内心的平静与自由。",
      "quote": "唯道集虚。虚者，心斋也。"
    },
    {
      "id": 5,
      "title": "德充符",
      "content": "鲁有兀者王骀，从之游者与夫子中分鲁。立不教，坐不议；虚而往，实而归。固有不言之教，无形而心成者邪？是何人也？仲尼曰：「夫子，圣人也，丘也直后而未往耳。丘将以为师，而况不若丘者乎！奚假鲁国！丘将引天下而与从之。」\n\n【解读】德充符论述「德」的充实与完善。庄子借王骀、申徒嘉等形残德全的人物，说明真正的价值不在于外在形貌，而在于内在的精神境界。「德有所长，而形有所忘」，道德充实的人，其精神魅力能感染他人。",
      "quote": "德有所长，而形有所忘。"
    },
    {
      "id": 6,
      "title": "大宗师",
      "content": "知天之所为，知人之所为者，至矣。知天之所为者，天而生也；知人之所为者，以其知之所知，以养其知之所不知，终其天年而不中道夭者，是知之盛也。\n\n虽然，有患。夫知有所待而后当，其所待者特未定也。庸讵知吾所谓天之非人乎？所谓人之非天乎？\n\n【解读】大宗师阐述「道」的本体和体道的方法。庄子描述了「真人」的境界：「不逆寡，不雄成，不谟士」，超越生死，与道合一。「坐忘」和「心斋」是体道的方法，忘却形体，抛弃聪明，与大道融通。",
      "quote": "相濡以沫，不如相忘于江湖。"
    },
    {
      "id": 7,
      "title": "应帝王",
      "content": "啮缺问于王倪，四问而四不知。啮缺因跃而大喜，行以告蒲衣子。蒲衣子曰：「而乃今知之乎？有虞氏不及泰氏。有虞氏，其犹藏仁以要人；亦得人矣，而未始出于非人。泰氏，其卧徐徐，其觉于于；一以己为马，一以己为牛；其知情信，其德甚真，而未始入于非人。」\n\n【解读】应帝王论述无为而治的政治理想。庄子通过多个寓言，说明好的统治者应当「无为」——顺应自然，不妄加干预。「至人之用心若镜，不将不迎，应而不藏」，统治者应当像镜子一样，如实反映民情，而不加主观臆断。",
      "quote": "至人之用心若镜，不将不迎，应而不藏，故能胜物而不伤。"
    }
  ],
  "last_sent_id": 0,
  "total_chapters": 7
}
